app/controllers/acompanamientos_controller.rb

  def index
    @acompanamientos = Acompanamiento.all
---
SELECT "acompanamientos".* FROM "acompanamientos"

  def create
    @acompanamiento = Acompanamiento.new(acompanamiento_params)

    respond_to do |format|
      if @acompanamiento.save
---
INSERT INTO "acompanamientos" ("acompanamientos", "dia", "semana", "soda_id") VALUES (?, ?, ?, ?)  [["acompanamientos", "arroz y frijoles\r\njugo de naranja"], ["dia", 4], ["semana", 3], ["soda_id", 1]]

  def update
    respond_to do |format|
      if @acompanamiento.update(acompanamiento_params)
---
UPDATE "acompanamientos" SET "acompanamiento" = ?, "ensalada1" = ?, "ensalada2" = ?, "ensalada3" = ?, "ensalada4" = ?, "ensalada5" = ?, "ensalada6" = ?, "fresco1" = ?, "fresco2" = ?, "frescosinazucar" = ?, "fruta1" = ?, "fruta2" = ?, "guarnicion" = ? WHERE "acompanamientos"."id" = 5

    def set_acompanamiento
      @acompanamiento = Acompanamiento.find(params[:id])
---
SELECT  "acompanamientos".* FROM "acompanamientos"  WHERE "acompanamientos"."id" = ? LIMIT 1  [["id", 1]]