app/controllers/platos_controller.rb

  def index
    @platos = Plato.all
---
SELECT "platos".* FROM "platos"