app/controllers/platos_controller.rb

SELECT "platos".* FROM "platos"   ORDER BY "platos"."soda_id" ASC, "platos"."semana" ASC, "platos"."dia" ASC, "platos"."categoria" ASC
---
  def index
    @platos = Plato.all.order(:soda_id).order(:semana).order(:dia).order(:categoria)

INSERT INTO "platos" ("calificaciones", "categoria", "created_at", "nombre", "precio", "soda_id", "tipo", "total", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @plato = Plato.new(plato_params)
    @plato.calificaciones = 0
    @plato.total = 0
    @plato.promedio = 0

    respond_to do |format|
      if @plato.save

UPDATE "platos" SET "categoria" = ?, "dia" = ?, "semana" = ?, "soda_id" = ?, "updated_at" = ? WHERE "platos"."id" = 2  [["categoria", "Básico 1"], ["dia", 1], ["semana", 3], ["soda_id", 1], ["updated_at", "2014-11-13 20:38:26.285937"]]
---
  def update
    respond_to do |format|
      if @plato.update(plato_params)

SELECT  "platos".* FROM "platos"  WHERE "platos"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_plato
      @plato = Plato.find(params[:id])