app/controllers/snacks_controller.rb

SELECT "snacks".* FROM "snacks"
---
  def index
    @snacks = Snack.all

INSERT INTO "snacks" ("created_at", "nombre", "precio", "soda_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-10-24 20:36:48.103895"], ["nombre", "Patacones"], ["precio", 700], ["soda_id", 1], ["updated_at", "2014-10-24 20:36:48.103895"]]
---
  def create
    @snack = Snack.new(snack_params)

    respond_to do |format|
      if @snack.save

UPDATE "snacks" SET "soda_id" = ?, "updated_at" = ? WHERE "snacks"."id" = 1  [["soda_id", 8], ["updated_at", "2014-10-24 20:55:10.311174"]]
---
  def update
    respond_to do |format|
      if @snack.update(snack_params)

SELECT  "snacks".* FROM "snacks"  WHERE "snacks"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_snack
      @snack = Snack.find(params[:id])