app/controllers/sodas_controller.rb

SELECT "sodas".* FROM "sodas"
---
  def index
    @sodas = Soda.all

INSERT INTO "sodas" ("created_at", "descripcion", "lat", "long", "nombre", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-10-24 22:13:54.572366"], ["descripcion", "df"], ["lat", 1.0], ["long", 3.0], ["nombre", "fsds"], ["updated_at", "2014-10-24 22:13:54.572366"]]
---
  def create
    @soda = Soda.new(soda_params)

    respond_to do |format|
      if @soda.save

SELECT  "sodas".* FROM "sodas"  WHERE "sodas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_soda
      @soda = Soda.find(params[:id])