app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "salt", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "crypted_password" = ?, "email" = ?, "salt" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["crypted_password", "$2a$10$efh6TlqcC6UX..jA.8fYdu.OwyXfIuiuAbmU9/XmNT7zIWSdV.L5."], ["email", "admin"], ["salt", "JDZ9FoAAgAtjns7mzRwp"], ["updated_at", "2014-11-21 19:58:32.879866"]]